<p dir = 'rtl'>  درس دوم.بخش سوم (series) </p>

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('C:/Users/Mahi/Desktop/project Pandas/Data/btc-usd.csv')
df.head()

,Date,Open,High,Low,Close,Adj Close,Volume
0,2021-04-30,53568.664063,57900.718750,53129.601563,57750.175781,57750.175781,52395931985
1,2021-05-01,57714.664063,58448.339844,57052.273438,57828.050781,57828.050781,42836427360
2,2021-05-02,57825.863281,57902.593750,56141.906250,56631.078125,56631.078125,38177405335
3,2021-05-03,56620.273438,58973.308594,56590.871094,57200.292969,57200.292969,51713139031
4,2021-05-04,57214.179688,57214.179688,53191.425781,53333.539063,53333.539063,68564706967

In [3]:
df = pd.read_csv('C:/Users/Mahi/Desktop/project Pandas/Data/btc-usd.csv', 
                 index_col='Date', 
                 parse_dates=['Date'])
df.head()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2021-04-30,53568.664063,57900.718750,53129.601563,57750.175781,57750.175781,52395931985
2021-05-01,57714.664063,58448.339844,57052.273438,57828.050781,57828.050781,42836427360
2021-05-02,57825.863281,57902.593750,56141.906250,56631.078125,56631.078125,38177405335
2021-05-03,56620.273438,58973.308594,56590.871094,57200.292969,57200.292969,51713139031
2021-05-04,57214.179688,57214.179688,53191.425781,53333.539063,53333.539063,68564706967

In [4]:
df.index

DatetimeIndex(['2021-04-30', '2021-05-01', '2021-05-02', '2021-05-03',
               '2021-05-04', '2021-05-05', '2021-05-06', '2021-05-07',
               '2021-05-08', '2021-05-09',
               ...
               '2022-04-21', '2022-04-22', '2022-04-23', '2022-04-24',
               '2022-04-25', '2022-04-26', '2022-04-27', '2022-04-28',
               '2022-04-29', '2022-04-30'],
              dtype='datetime64[ns]', name='Date', length=366, freq=None)

In [5]:
df['Close']

Date
2021-04-30    57750.175781
2021-05-01    57828.050781
2021-05-02    56631.078125
2021-05-03    57200.292969
2021-05-04    53333.539063
                  ...
2022-04-26    38117.460938
2022-04-27    39241.121094
2022-04-28    39773.828125
2022-04-29    38609.824219
2022-04-30    38281.816406
Name: Close, Length: 366, dtype: float64

In [6]:
type(df['Close'])

pandas.core.series.Series

In [7]:
s1 = pd.read_csv(
    'C:/Users/Mahi/Desktop/project Pandas/Data/btc-usd.csv',
    index_col='Date',
    parse_dates=['Date']
)['Close']
s1.head()

Date
2021-04-30    57750.175781
2021-05-01    57828.050781
2021-05-02    56631.078125
2021-05-03    57200.292969
2021-05-04    53333.539063
Name: Close, dtype: float64

In [8]:
s2 = pd.read_csv(
    'C:/Users/Mahi/Desktop/project Pandas/Data/btc-usd.csv',
    index_col='Date',
    parse_dates=['Date'],
    usecols=['Date','Close'],
).squeeze()
s2.head(10)

Date
2021-04-30    57750.175781
2021-05-01    57828.050781
2021-05-02    56631.078125
2021-05-03    57200.292969
2021-05-04    53333.539063
2021-05-05    57424.007813
2021-05-06    56396.515625
2021-05-07    57356.402344
2021-05-08    58803.777344
2021-05-09    58232.316406
Name: Close, dtype: float64

In [9]:
s3 = pd.read_csv(
    'C:/Users/Mahi/Desktop/project Pandas/Data/employees.csv',
    index_col='First Name',
    usecols=['First Name','Salary'],
).squeeze()
s1.head(10)

Date
2021-04-30    57750.175781
2021-05-01    57828.050781
2021-05-02    56631.078125
2021-05-03    57200.292969
2021-05-04    53333.539063
2021-05-05    57424.007813
2021-05-06    56396.515625
2021-05-07    57356.402344
2021-05-08    58803.777344
2021-05-09    58232.316406
Name: Close, dtype: float64

In [10]:
len(s3)

1001

In [11]:
s3.count()

999

In [12]:
s3.describe()

count       999.000000
mean      90655.528529
std       32939.511615
min       35013.000000
25%       62560.000000
50%       90427.000000
75%      118744.500000
max      149908.000000
Name: Salary, dtype: float64

In [13]:
s3.sort_values()

First Name
Michael       35013.0
Kevin         35061.0
Steven        35095.0
Matthew       35203.0
Cynthia       35381.0
               ...
Cynthia      149684.0
Rose         149903.0
Katherine    149908.0
Douglas           NaN
NaN               NaN
Name: Salary, Length: 1001, dtype: float64

In [14]:
s3.sort_values(ascending=False)

First Name
Katherine    149908.0
Rose         149903.0
Cynthia      149684.0
NaN          149654.0
Kathy        149563.0
               ...
Steven        35095.0
Kevin         35061.0
Michael       35013.0
Douglas           NaN
NaN               NaN
Name: Salary, Length: 1001, dtype: float64

In [15]:
s3.sort_values(na_position='first')

First Name
Douglas           NaN
NaN               NaN
Michael       35013.0
Kevin         35061.0
Steven        35095.0
               ...
Kathy        149563.0
NaN          149654.0
Cynthia      149684.0
Rose         149903.0
Katherine    149908.0
Name: Salary, Length: 1001, dtype: float64

In [16]:
s3.sort_values(ascending=False, 
               na_position='first')

First Name
Douglas           NaN
NaN               NaN
Katherine    149908.0
Rose         149903.0
Cynthia      149684.0
               ...
Cynthia       35381.0
Matthew       35203.0
Steven        35095.0
Kevin         35061.0
Michael       35013.0
Name: Salary, Length: 1001, dtype: float64

In [17]:
s3.dropna()

First Name
Thomas      61933.0
Maria      130590.0
Jerry      138705.0
Larry      101004.0
Dennis     115163.0
             ...
Henry      132483.0
Phillip     42392.0
Russell     96914.0
Larry       60500.0
Albert     129949.0
Name: Salary, Length: 999, dtype: float64

In [18]:
s3.dropna().sort_values()

First Name
Michael       35013.0
Kevin         35061.0
Steven        35095.0
Matthew       35203.0
Cynthia       35381.0
               ...
Kathy        149563.0
NaN          149654.0
Cynthia      149684.0
Rose         149903.0
Katherine    149908.0
Name: Salary, Length: 999, dtype: float64

In [19]:
s3.sort_index()

First Name
Aaron     61602.0
Aaron     58755.0
Aaron     52119.0
Aaron     63126.0
Adam      95327.0
           ...
NaN       95866.0
NaN      133472.0
NaN      107351.0
NaN      143638.0
NaN           NaN
Name: Salary, Length: 1001, dtype: float64

In [20]:
s3.sort_index().head(10)

First Name
Aaron     61602.0
Aaron     58755.0
Aaron     52119.0
Aaron     63126.0
Adam      95327.0
Adam     110194.0
Adam      71276.0
Adam      45181.0
Alan     111786.0
Alan      40341.0
Name: Salary, dtype: float64

In [21]:
s3.sort_index(ascending=False)

First Name
Willie     64363.0
Willie    141932.0
Willie     55038.0
Willie    146651.0
Willie     55281.0
            ...
NaN        95866.0
NaN       133472.0
NaN       107351.0
NaN       143638.0
NaN            NaN
Name: Salary, Length: 1001, dtype: float64

In [22]:
s3.sort_index(na_position='first')

First Name
NaN        45906.0
NaN       125792.0
NaN        37076.0
NaN       122340.0
NaN       122173.0
            ...
Willie     55038.0
Willie     64363.0
Willie    146651.0
Willie     55281.0
Willie    141932.0
Name: Salary, Length: 1001, dtype: float64

In [23]:
s3.nlargest(3)

First Name
Katherine    149908.0
Rose         149903.0
Cynthia      149684.0
Name: Salary, dtype: float64

In [24]:
s3.nsmallest(10)

First Name
Michael      35013.0
Kevin        35061.0
Steven       35095.0
Matthew      35203.0
Cynthia      35381.0
Christina    35477.0
Kathleen     35575.0
Terry        35633.0
Bruce        35802.0
Frances      35884.0
Name: Salary, dtype: float64

In [25]:
s3.nsmallest(10).describe()

count       10.000000
mean     35412.400000
std        313.058461
min      35013.000000
25%      35122.000000
50%      35429.000000
75%      35618.500000
max      35884.000000
Name: Salary, dtype: float64

In [26]:
s3.nlargest(10).describe()

count        10.000000
mean     149405.600000
std         401.444115
min      148857.000000
25%      149015.000000
50%      149509.500000
75%      149676.500000
max      149908.000000
Name: Salary, dtype: float64

In [27]:
s4 = pd.read_csv(
    'C:/Users/Mahi/Desktop/project Pandas/Data/employees.csv',
    index_col='First Name',
    usecols=['First Name','Salary'],
).squeeze()
s4.head(10)

First Name
Douglas         NaN
Thomas      61933.0
Maria      130590.0
Jerry      138705.0
Larry      101004.0
Dennis     115163.0
Ruby        65476.0
NaN         45906.0
Angela      95570.0
Frances    139852.0
Name: Salary, dtype: float64

In [28]:
s4.dropna()

First Name
Thomas      61933.0
Maria      130590.0
Jerry      138705.0
Larry      101004.0
Dennis     115163.0
             ...
Henry      132483.0
Phillip     42392.0
Russell     96914.0
Larry       60500.0
Albert     129949.0
Name: Salary, Length: 999, dtype: float64

In [29]:
s4

First Name
Douglas         NaN
Thomas      61933.0
Maria      130590.0
Jerry      138705.0
Larry      101004.0
             ...
Phillip     42392.0
Russell     96914.0
Larry       60500.0
Albert     129949.0
NaN             NaN
Name: Salary, Length: 1001, dtype: float64

In [30]:
s4.dropna(inplace=True)

In [31]:
s4

First Name
Thomas      61933.0
Maria      130590.0
Jerry      138705.0
Larry      101004.0
Dennis     115163.0
             ...
Henry      132483.0
Phillip     42392.0
Russell     96914.0
Larry       60500.0
Albert     129949.0
Name: Salary, Length: 999, dtype: float64

In [32]:
s4.sort_values()

First Name
Michael       35013.0
Kevin         35061.0
Steven        35095.0
Matthew       35203.0
Cynthia       35381.0
               ...
Kathy        149563.0
NaN          149654.0
Cynthia      149684.0
Rose         149903.0
Katherine    149908.0
Name: Salary, Length: 999, dtype: float64

In [33]:
s4

First Name
Thomas      61933.0
Maria      130590.0
Jerry      138705.0
Larry      101004.0
Dennis     115163.0
             ...
Henry      132483.0
Phillip     42392.0
Russell     96914.0
Larry       60500.0
Albert     129949.0
Name: Salary, Length: 999, dtype: float64

In [34]:
s4.sort_values(inplace=True)

In [35]:
s4

First Name
Michael       35013.0
Kevin         35061.0
Steven        35095.0
Matthew       35203.0
Cynthia       35381.0
               ...
Kathy        149563.0
NaN          149654.0
Cynthia      149684.0
Rose         149903.0
Katherine    149908.0
Name: Salary, Length: 999, dtype: float64

In [36]:
df2 = pd.read_csv('C:/Users/Mahi/Desktop/project Pandas/Data/movies.csv', index_col='name')
df2.head()

,rating,genre,year,release_date,release_country,score,votes,director,writer,star,country,budget,gross,company,runtime
name,,,,,,,,,,,,,,,
The Shining,R,Drama,1980,"June 13, 1980",United States,8.4,927000.0,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000.0,46998772.0,Warner Bros.,146.0
The Blue Lagoon,R,Adventure,1980,"July 2, 1980",United States,5.8,65000.0,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000.0,58853106.0,Columbia Pictures,104.0
Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980",United States,8.7,1200000.0,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000.0,538375067.0,Lucasfilm,124.0
Airplane!,PG,Comedy,1980,"July 2, 1980",United States,7.7,221000.0,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000.0,83453539.0,Paramount Pictures,88.0
Caddyshack,R,Comedy,1980,"July 25, 1980",United States,7.3,108000.0,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000.0,39846344.0,Orion Pictures,98.0

In [37]:
rating = df2['rating']

In [38]:
type(rating)

pandas.core.series.Series

In [39]:
rating.head()

name
The Shining                                        R
The Blue Lagoon                                    R
Star Wars: Episode V - The Empire Strikes Back    PG
Airplane!                                         PG
Caddyshack                                         R
Name: rating, dtype: object

In [40]:
rating.value_counts()

rating
R            3695
PG-13        2112
PG           1252
Not Rated     283
G             153
Unrated        52
NC-17          23
TV-MA           9
TV-PG           5
X               3
Approved        1
TV-14           1
Name: count, dtype: int64

In [41]:
rating.value_counts().sort_index()

rating
Approved        1
G             153
NC-17          23
Not Rated     283
PG           1252
PG-13        2112
R            3695
TV-14           1
TV-MA           9
TV-PG           5
Unrated        52
X               3
Name: count, dtype: int64

In [42]:
rating.value_counts(ascending=True)

rating
Approved        1
TV-14           1
X               3
TV-PG           5
TV-MA           9
NC-17          23
Unrated        52
G             153
Not Rated     283
PG           1252
PG-13        2112
R            3695
Name: count, dtype: int64

In [43]:
rating.value_counts(normalize="False")

rating
R            0.486889
PG-13        0.278298
PG           0.164976
Not Rated    0.037291
G            0.020161
Unrated      0.006852
NC-17        0.003031
TV-MA        0.001186
TV-PG        0.000659
X            0.000395
Approved     0.000132
TV-14        0.000132
Name: proportion, dtype: float64

In [44]:
rating.value_counts(normalize=True)*100

rating
R            48.688892
PG-13        27.829754
PG           16.497562
Not Rated     3.729082
G             2.016076
Unrated       0.685202
NC-17         0.303070
TV-MA         0.118593
TV-PG         0.065885
X             0.039531
Approved      0.013177
TV-14         0.013177
Name: proportion, dtype: float64

In [45]:
rating.value_counts(normalize=True).mul(100).round(1)

rating
R            48.7
PG-13        27.8
PG           16.5
Not Rated     3.7
G             2.0
Unrated       0.7
NC-17         0.3
TV-MA         0.1
TV-PG         0.1
X             0.0
Approved      0.0
TV-14         0.0
Name: proportion, dtype: float64

In [46]:
score = df2.score

In [47]:
score.value_counts()

score
6.6    359
6.4    351
6.2    346
6.7    332
6.5    331
      ...
2.8      2
9.3      1
2.6      1
2.3      1
9.0      1
Name: count, Length: 72, dtype: int64

In [48]:
score.value_counts(bins=5)

(6.34, 7.82]                  3858
(4.86, 6.34]                  2964
(3.38, 4.86]                   438
(7.82, 9.3]                    354
(1.8920000000000001, 3.38]      49
Name: count, dtype: int64

In [49]:
score.value_counts(bins=5).sort_index()

(1.8920000000000001, 3.38]      49
(3.38, 4.86]                   438
(4.86, 6.34]                  2964
(6.34, 7.82]                  3858
(7.82, 9.3]                    354
Name: count, dtype: int64

In [50]:
score.value_counts(bins=[1,3,5,7,9,10]).sort_index()

(0.999, 3.0]      34
(3.0, 5.0]       601
(5.0, 7.0]      5052
(7.0, 9.0]      1975
(9.0, 10.0]        1
Name: count, dtype: int64

In [51]:
score.value_counts(bins=5, sort=False)

(1.8920000000000001, 3.38]      49
(3.38, 4.86]                   438
(4.86, 6.34]                  2964
(6.34, 7.82]                  3858
(7.82, 9.3]                    354
Name: count, dtype: int64

In [52]:
rating.value_counts(sort=False)

rating
R            3695
PG           1252
G             153
Not Rated     283
NC-17          23
Approved        1
TV-PG           5
PG-13        2112
Unrated        52
X               3
TV-MA           9
TV-14           1
Name: count, dtype: int64

In [53]:
score.count()

7663

In [54]:
len(score)

7666

In [55]:
score.value_counts(dropna=False).tail(10)

score
8.9    3
1.9    3
NaN    3
2.1    2
2.4    2
2.8    2
9.3    1
2.6    1
2.3    1
9.0    1
Name: count, dtype: int64

In [56]:
score.value_counts().tail(10)

score
8.7    4
8.9    3
1.9    3
2.1    2
2.4    2
2.8    2
9.3    1
2.6    1
2.3    1
9.0    1
Name: count, dtype: int64

In [57]:
df3 = pd.read_csv('C:/Users/Mahi/Desktop/project Pandas/Data/movies.csv', index_col='name')
df3.head()

,rating,genre,year,release_date,release_country,score,votes,director,writer,star,country,budget,gross,company,runtime
name,,,,,,,,,,,,,,,
The Shining,R,Drama,1980,"June 13, 1980",United States,8.4,927000.0,Stanley Kubrick,Stephen King,Jack Nicholson,United Kingdom,19000000.0,46998772.0,Warner Bros.,146.0
The Blue Lagoon,R,Adventure,1980,"July 2, 1980",United States,5.8,65000.0,Randal Kleiser,Henry De Vere Stacpoole,Brooke Shields,United States,4500000.0,58853106.0,Columbia Pictures,104.0
Star Wars: Episode V - The Empire Strikes Back,PG,Action,1980,"June 20, 1980",United States,8.7,1200000.0,Irvin Kershner,Leigh Brackett,Mark Hamill,United States,18000000.0,538375067.0,Lucasfilm,124.0
Airplane!,PG,Comedy,1980,"July 2, 1980",United States,7.7,221000.0,Jim Abrahams,Jim Abrahams,Robert Hays,United States,3500000.0,83453539.0,Paramount Pictures,88.0
Caddyshack,R,Comedy,1980,"July 25, 1980",United States,7.3,108000.0,Harold Ramis,Brian Doyle-Murray,Chevy Chase,United States,6000000.0,39846344.0,Orion Pictures,98.0

In [58]:
score = df3.score

In [59]:
def verbal_score(s):
    if s >= 7.5:
        return 'High'
    elif s >= 6.5:
        return 'Medium'
    else:
        return 'Low'

In [60]:
verbal_score(8)

'High'

In [61]:
verbal_score(3)

'Low'

In [62]:
verbal_score(6.8)

'Medium'

In [63]:
verbal_score(score)

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [ ]:
score.apply(verbal_score)

In [ ]:
score.apply(verbal_score).value_counts(
    normalize=True).mul(100).round()

score
Low       50.0
Medium    38.0
High      13.0
Name: proportion, dtype: float64

In [ ]:
score.dropna().apply(round)

name
The Shining                                       8
The Blue Lagoon                                   6
Star Wars: Episode V - The Empire Strikes Back    9
Airplane!                                         8
Caddyshack                                        7
                                                 ..
Aloha Surf Hotel                                  7
More to Life                                      3
Dream Round                                       5
Saving Mbango                                     6
Tee em el                                         6
Name: score, Length: 7663, dtype: int64